{
    "_name_or_path": "/path/to/llama2",
    "architectures": [
      "LlamaForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "freeze_mm_mlp_adapter": false,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "image_aspect_ratio": "pad",
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 2048,
    "mm_hidden_size": 1024,
    "mm_projector_lr": 2e-05,
    "mm_projector_type": "mlp2x_gelu",
    "mm_use_im_patch_token": false,
    "mm_use_im_start_end": false,
    "mm_vision_select_feature": "patch",
    "mm_vision_select_layer": -2,
    "mm_vision_tower": "/path/to/clip",
    "model_type": "llava",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pad_token_id": 0,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "tokenizer_model_max_length": 2048,
    "tokenizer_padding_side": "right",
    "torch_dtype": "float16",
    "transformers_version": "4.31.0",
    "tune_mm_mlp_adapter": false,
    "use_cache": false,
    "use_mm_proj": true,
    "vocab_size": 32000
  }
  